podonoghue/usbdm-eclipse-makefiles-build-4.10.6.250/PackageFiles/DeviceData/Device.SVD/peripherals/FMC_MK64F12.svd.xml
            <register>
               <name>PFB0CR</name>
               <description>Flash Bank 0 Control Register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x3002001F</resetValue>
               <fields>
                  <field>
                     <name>B0SEBE</name>
                     <description>Bank 0 Single Entry Buffer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Single entry buffer is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Single entry buffer is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0IPE</name>
                     <description>Bank 0 Instruction Prefetch Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not prefetch in response to instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable prefetches in response to instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0DPE</name>
                     <description>Bank 0 Data Prefetch Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not prefetch in response to data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable prefetches in response to data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0ICE</name>
                     <description>Bank 0 Instruction Cache Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not cache instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0DCE</name>
                     <description>Bank 0 Data Cache Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not cache data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRC</name>
                     <description>Cache Replacement Control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>LRU replacement algorithm per set across all four ways</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Reserved</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Independent LRU with ways [0-1] for ifetches, [2-3] for data</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Independent LRU with ways [0-2] for ifetches, [3] for data</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1xx</name>
                           <description>Reserved</description>
                           <value>0b1xx</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0MW</name>
                     <description>Bank 0 Memory Width</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>32 bits</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>64 bits</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1x</name>
                           <description>Reserved</description>
                           <value>0b1x</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>S_B_INV</name>
                     <description>Invalidate Prefetch Speculation Buffer</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Speculation buffer and single entry buffer are not affected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Invalidate (clear) speculation buffer and single entry buffer</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CINV_WAY</name>
                     <description>Cache Invalidate Way x</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No cache way invalidation for the corresponding cache</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Invalidate cache way for the corresponding cache: clear the tag, data, and vld bits of ways selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLCK_WAY</name>
                     <description>Cache Lock Way x</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Cache way is unlocked and may be displaced</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache way is locked and its contents are not displaced</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0RWSC</name>
                     <description>Bank 0 Read Wait State Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFB1CR</name>
               <description>Flash Bank 1 Control Register</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x3002001F</resetValue>
               <fields>
                  <field>
                     <name>B1SEBE</name>
                     <description>Bank 1 Single Entry Buffer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Single entry buffer is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Single entry buffer is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1IPE</name>
                     <description>Bank 1 Instruction Prefetch Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not prefetch in response to instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable prefetches in response to instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1DPE</name>
                     <description>Bank 1 Data Prefetch Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not prefetch in response to data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable prefetches in response to data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1ICE</name>
                     <description>Bank 1 Instruction Cache Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not cache instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1DCE</name>
                     <description>Bank 1 Data Cache Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not cache data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1MW</name>
                     <description>Bank 1 Memory Width</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>32 bits</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>64 bits</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1x</name>
                           <description>Reserved</description>
                           <value>0b1x</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1RWSC</name>
                     <description>Bank 1 Read Wait State Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TAGVDW,@pTAGVDW@i@f</name>
               <addressOffset>0x100</addressOffset>
               <register>
                  <name>S0</name>
                  <description>Cache Tag Storage</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>1-bit valid for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>tag</name>
                        <description>13-bit tag for cache entry</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1</name>
                  <description>Cache Tag Storage</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>1-bit valid for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>tag</name>
                        <description>13-bit tag for cache entry</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2</name>
                  <description>Cache Tag Storage</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>1-bit valid for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>tag</name>
                        <description>13-bit tag for cache entry</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3</name>
                  <description>Cache Tag Storage</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>1-bit valid for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>tag</name>
                        <description>13-bit tag for cache entry</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>4</dim>
               <dimIncrement>32</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>DATAW,@pDATAW@i@f</name>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>S0U</name>
                  <description>Cache Data Storage (upper word)</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0L</name>
                  <description>Cache Data Storage (lower word)</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1U</name>
                  <description>Cache Data Storage (upper word)</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1L</name>
                  <description>Cache Data Storage (lower word)</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2U</name>
                  <description>Cache Data Storage (upper word)</description>
                  <addressOffset>0x10</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2L</name>
                  <description>Cache Data Storage (lower word)</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3U</name>
                  <description>Cache Data Storage (upper word)</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3L</name>
                  <description>Cache Data Storage (lower word)</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
